{
  "backend/main.mo": "Main Motoko actor defining the store's data types (Product, Order, UserProfile, etc.) and all public API methods for managing products, categories, orders, subscriptions, store settings, and admin access control using a mixin authorization pattern.",
  "backend/migration.mo": "Migration module that defines old and new actor state shapes and a `run` function to drop legacy admin PIN/session maps during canister upgrade.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no recorded features.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, used as build planning reference documentation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML entry point for the Game Vault app that sets the dark class, inlines critical dark background CSS to prevent flash, and mounts the React app via `src/main.tsx`.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, routing via hash-based navigation, cart state, Internet Identity authentication, and renders the appropriate page component based on the current route.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Standalone screen component displaying an access denied message with a shield icon and a back-to-store link for users lacking admin privileges.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "React component for managing the admin username whitelist, allowing admins to add or remove usernames with confirmation dialogs and toast notifications, backed by React Query cache.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin component that fetches and displays all orders in a searchable table, showing buyer info, product ID, payment method, and status badges with error/loading states.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin component for reviewing and acting on orders, displaying payment method and status badges per order row with approve/decline mutation actions and toast feedback.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, price, and availability, with add/update mutations and toast notifications.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin component that lists all products in a table with options to add, edit, or delete products via dialogs, using product and category query hooks.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), with individual save buttons per wallet field that call their respective mutation hooks.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for managing subscription tiers, allowing price updates, free trial toggling, and tier deletion/creation via mutation hooks with expandable tier rows.",
  "frontend/src/components/AdminAccessControl.tsx": "Wrapper component that checks whether the authenticated caller has admin privileges via `isCallerAdmin()` and renders children only on success, otherwise showing a login prompt, loading spinner, or denied screen.",
  "frontend/src/components/CartDrawer.tsx": "A slide-in drawer component displaying cart items with quantity, price, remove functionality, and a checkout button showing the total cost.",
  "frontend/src/components/CategoryCard.tsx": "A button component that renders a selectable product category pill with active/inactive styling.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a lightweight SVG QR code generator, copy-to-clipboard, and a confirm button.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code (mock), collects card number and balance, then calls the confirm callback.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into three monthly installments, displays the schedule with due dates, and requires user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight for the currently selected method.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user 'returns' from PayPal before placing the order.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Game Vault brand, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "A no-op stub component kept for compatibility; actual layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "A full-screen loading screen with a 40-second video background and a clip-path progress reveal animation on the 'GAME VAULT' title, fading out when complete.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout support.",
  "frontend/src/components/ProductCard.tsx": "A card component displaying a product's game name, title, description, price, and an 'Add to Cart' button with a click-through to a detail view.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal for new users to choose a username, with debounced availability checking and validation before submitting via the createUsername mutation.",
  "frontend/src/contexts/AdminSessionContext.tsx": "Provides a React context and hook for tracking whether the admin user has been verified in the current session.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCart.ts": "Implements a cart context and hook with add, remove, and clear operations, tracking items, total quantity, and total price using BigInt arithmetic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook wrapping DFINITY's AuthClient, exposing login/logout functions and status flags for use throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including CRUD operations for categories, products, orders, user profiles, and subscriptions via the ICP actor.",
  "frontend/src/index.css": "Defines global CSS custom properties for a sunset-themed design system (colors, glow effects, gradients) and sets base typography using Orbitron and Rajdhani fonts via Tailwind layers.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js/R3F 3D vehicle models (SportsCar, Motorcycle, RealisticCar) as React components with geometry, materials, and animated movement along lanes.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tab-based navigation for managing products, orders, payments, admins, subscriptions, and store settings. Wraps content in AdminAccessControl to restrict access.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info and places an order via the usePlaceOrder hook, supporting PayPal, crypto, gift card, and Pay in 3 payment methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation after purchase, showing order details, product info, and approval status (pending/approved/declined); falls back to a generic success screen when the order ID is unknown.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing game name, description, category, price, availability, and an add-to-cart button in a two-column layout with a sticky sidebar.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with a hero section, search bar, and a filterable product grid that fetches available products and categories from the backend.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and cryptocurrency payment methods, displaying tier details, billing cycle, free trial info, and crypto wallet addresses for payment.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards with monthly/yearly billing toggle, fetching tiers via useGetSubscriptionTiers hook and rendering pricing, perks, and subscribe/free-trial buttons.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, with helpers to persist, retrieve, and clear parameters via sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a sunset/dusk color palette, Orbitron and Rajdhani font families, custom box shadows, and keyframe animations like pulse-glow and shimmer.",
  "project_state.json": "Project state file tracking two pending fix requests: correcting backend admin principal verification for product mutations and ensuring the frontend passes an authenticated actor when calling those mutations."
}