{
  "backend/main.mo": "Main Motoko actor defining all backend types, state, and public functions for a game vault store including products, categories, orders, user profiles, store settings, subscription tiers, and admin PIN lockout logic with access control via mixins.",
  "backend/migration.mo": "Data migration module that upgrades the actor state from an older schema to a newer one by adding the `adminPinAttempts` and `adminPinLockoutTime` maps while preserving all existing state fields.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, associated files, components, test IDs, and confidence levels — covering PIN verification hooks, AdminAccessControl rewrite, and related frontend changes.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend source files describing the purpose and key implementation details of each component, page, and utility file in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for both light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML entry point for the Game Vault app with the `dark` class pre-applied and inline critical CSS to prevent a white flash before React hydrates.",
  "frontend/src/App.tsx": "Root React application component implementing hash-based routing, cart state management, Internet Identity authentication, profile setup modal, and rendering of all pages wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Standalone screen component displayed when a user lacks admin privileges, showing a shield icon, an error message, and a link back to the store.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "Admin UI component for managing the admin username whitelist, allowing adding and removing admin users with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin table view displaying all orders with buyer details, product name (fetched per row), payment method badge, and order status badge.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin payments dashboard that lists all orders in a table with payment method and approval status badges, and allows approving or declining individual orders using index-based order IDs.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, account details, price (converted to pence), and availability, with add/update mutations.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin product list view with a table of all products, supporting add (via dialog), edit, and delete (via alert dialog) operations using ProductForm and relevant React Query hooks.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), with pre-populated fields loaded from settings and individual save buttons for each wallet.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for managing subscription tiers, allowing editing of monthly/yearly prices and toggling free trial availability per tier.",
  "frontend/src/components/AdminAccessControl.tsx": "Wraps admin content behind Internet Identity authentication and a 4-digit PIN verification, handling lockout countdowns and error states before rendering children.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer displaying cart items with remove buttons, a total price, and a checkout action button.",
  "frontend/src/components/CategoryCard.tsx": "Renders a selectable category filter button that highlights when its category is active.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a generated QR code, copy functionality, and converted crypto amounts.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code and collects the card number and balance before confirming the order.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into 3 monthly installments, showing a schedule of due dates and requiring user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight for the currently selected method.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user returns from PayPal before finalizing the order.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Stub component that renders nothing; layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "Full-screen loading splash with a looping NYC sunset video background and a 40-second clip-path progress reveal of the 'GAME VAULT' title before allowing entry.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's category, game name, title, description, price, and an add-to-cart button, with a click handler to view full details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and validation (no spaces, min 3 chars) before submitting via the createUsername mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart with add, remove, and clear operations, plus derived totals for item count and price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions and identity state with login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, admin checks, products, orders, and store settings with actor-based query functions.",
  "frontend/src/index.css": "Defines global CSS with Tailwind directives, a sunset-themed design token palette (OKLCH colors), custom glow utility classes, and Orbitron/Rajdhani font assignments.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle components (SportsCar, Motorcycle, RealisticCar) built from primitive geometries, used as animated scene objects in a React Three Fiber context.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tab-based navigation for managing products, orders, payments, admins, subscriptions, and store settings. Wraps content in AdminAccessControl to restrict access.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects order info and submits it via usePlaceOrder, supporting PayPal, crypto, gift card, and Pay in 3 methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that fetches and displays order details including product info and live approval status (pending/approved/declined) with a continue shopping button.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing game name, description, category, price, availability, and an add-to-cart button in a two-column layout with a sticky sidebar.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with a hero section, search bar, and filtered product grid fetched from the backend, supporting loading, error, and empty states.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page (review, payment method, payment details, confirmation) supporting PayPal and cryptocurrency payments, with free trial display and a step indicator.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, tier-specific icons/colors, and a subscribe callback prop. Fetches tier data via a custom query hook and renders pricing, perks, and free trial badges.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens (including a sunset palette), Orbitron/Rajdhani fonts, custom box shadows, and keyframe animations; includes animate, typography, and container-queries plugins.",
  "project_state.json": "Project state snapshot (version 67) describing Game Vault, a gaming accounts e-commerce store on ICP with Internet Identity auth, sunset UI theme, subscription tiers, admin PIN gate, and known issues around product/category creation flows."
}