{
  "backend/main.mo": "Main Motoko actor for the Game Vault backend, defining types and state for products, categories, orders, users, subscriptions, and store settings, with admin-gated CRUD operations and access control via MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report listing two features: removing the 'Initialize Default Tiers' button from SubscriptionManager.tsx and fixing the end-to-end order placement flow so orders appear in the admin panel.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and notable recent changes.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including colors for background, foreground, cards, charts, and sidebar.",
  "frontend/index.html": "HTML entry point for the Game Vault app with dark class pre-applied and inline critical CSS to prevent white flash before React hydrates.",
  "frontend/src/App.tsx": "Root React component implementing hash-based client-side routing, cart state management, authentication checks, profile setup modal, and rendering of all page components wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Standalone screen component displayed when a user lacks admin privileges, showing a shield icon, error message, and a link back to the store.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "Admin UI component for managing the admin username whitelist, allowing adding and removing admin users with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin table view displaying all orders with buyer details, product name (fetched per row), payment method badge, and order status badge.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin payments dashboard that lists all orders in a table with payment method and approval status badges, and allows approving or declining individual orders via mutation hooks.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, account details, price (converted to pence), and availability, using add/update product mutations.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin product list component that displays all products in a table with add, edit, and delete actions, using dialogs for the product form and alert dialogs for deletion confirmation.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), with individual save buttons and pre-populated fields loaded from store settings.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for managing subscription tier pricing and free trial toggles, with inline editing for monthly/yearly prices per tier.",
  "frontend/src/components/AdminAccessControl.tsx": "Wraps admin content behind Internet Identity authentication and a 4-digit PIN verification, with lockout handling and a countdown timer for failed attempts.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component that displays cart items with prices, supports item removal, shows a total, and triggers checkout.",
  "frontend/src/components/CategoryCard.tsx": "Renders a selectable category filter button that highlights when active and calls a callback on selection.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a lightweight SVG QR code generator, copy-to-clipboard, and USD-to-crypto conversion.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code, collects card number and balance, and confirms the order.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into three equal monthly installments, showing a schedule with due dates and requiring user agreement before confirming.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight for the currently selected method.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user 'returns' from PayPal before placing the order.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Stub component kept for compatibility; layout is handled directly in App.tsx and this renders nothing.",
  "frontend/src/components/LoadingScreen3D.tsx": "Full-screen loading splash with a looping NYC sunset video background and a 40-second animated text reveal progress bar before allowing the user to enter the store.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with its category, game name, title, description, price, and an add-to-cart button; clicking the card triggers a detail view.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and validation (no spaces, min 3 chars) before submitting via the createUsername mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing dependent queries whenever the identity changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart, supporting add, remove, and clear operations with computed total items and total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity state, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, admin checks, products, orders, and store settings via the ICP actor.",
  "frontend/src/index.css": "Defines global CSS with Tailwind directives, a sunset-themed design token palette (OKLCH colors), custom glow utility classes, and Orbitron/Rajdhani font imports.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle models (SportsCar, Motorcycle, RealisticCar) as React components using @react-three/fiber, with animated movement via useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tab-based navigation for managing products, orders, payments, admins, subscriptions, and store settings. Wraps content in AdminAccessControl to restrict access.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info and places orders via usePlaceOrder, supporting PayPal, crypto, gift card, and Pay-in-3 methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details after purchase, including product info and a live approval status badge (pending/approved/declined) fetched via useGetOrderById.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing game name, description, category, price, availability, and an add-to-cart button in a two-column layout with a sticky sidebar.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page displaying available products in a grid with a hero section and search bar, filtering products client-side by name, title, or description.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and cryptocurrency payment methods, with a step indicator, plan review, and free trial display for a given subscription tier and billing cycle.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, tier-specific icons/colors, and a subscribe callback prop. Fetches tier data via a query hook and renders pricing, perks, and free trial badges.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens (including a sunset palette), Orbitron/Rajdhani fonts, custom box shadows, and keyframe animations; includes animate, typography, and container-queries plugins.",
  "project_state.json": "Project state snapshot (version 73) describing the Game Vault ICP e-commerce app's architecture, features (sunset theme, subscription tiers, admin PIN gate, payment flows), and known issues such as broken product/category creation in the admin panel."
}