{
  "backend/main.mo": "Main Motoko actor implementing the Game Vault backend with CRUD operations for categories, products, orders, and user profiles, protected by role-based access control (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report mapping two UI features—removing the logo image from Navigation and applying a red→purple→orange gradient to 'Game Vault' brand text—to their affected files and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and key functionality of pages, components, and style files.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based design tokens for light and dark themes via CSS custom properties, with base body and border styles applied.",
  "frontend/index.html": "Minimal HTML shell setting the page title to 'Game Vault' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sequences the 3D loading screen before rendering the TanStack Router-based app with routes for storefront, product detail, checkout, order confirmation, and admin panel, wrapped in theme and cart providers.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component displaying a shield icon, error message, and a back-to-store link for users lacking admin privileges.",
  "frontend/src/components/admin/CategoryForm.tsx": "Admin form for creating or editing a product category, with name and description fields and save/cancel actions backed by add/edit mutation hooks.",
  "frontend/src/components/admin/CategoryManager.tsx": "Admin UI component for listing, creating, editing, and deleting product categories, using a table view with dialog forms and confirmation alerts.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, category, price, and availability, with add/edit mutation hooks.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin UI component for listing, creating, editing, and deleting products in a table, with dialog forms and delete confirmation alerts.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component showing cart items with quantities and prices, remove buttons, total price, and a checkout action, using a Sheet UI primitive.",
  "frontend/src/components/CategoryCard.tsx": "Clickable category card button displaying a tag icon, category name, optional product count, and description, with highlighted styling when selected.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout payment step that displays a mock BTC or ETH wallet address and calculated crypto amount, with copy functionality and a confirmation checkbox before submitting.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout payment step that allows users to enter and apply a UK gift card code, with mock validation logic and a confirmation flow.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Renders a 'Pay in 3 Installments' checkout UI that splits a total into three interest-free payments scheduled today, +30 days, and +60 days, with a terms agreement checkbox and confirm/back buttons.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Displays a list of selectable payment methods (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with styled highlight on the currently selected option.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Renders a PayPal checkout step that simulates a PayPal redirect with a 2-second delay, then enables the confirm button once the simulated authorization is complete.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, store navigation links, accepted payment methods, and a copyright/attribution bar.",
  "frontend/src/components/Layout.tsx": "Top-level layout wrapper that composes Navigation, a main content outlet, and Footer into a full-height flex column.",
  "frontend/src/components/LoadingScreen3D.tsx": "A Three.js/React Three Fiber loading screen featuring an animated 3D driving scene with a road, NYC skyline, sunset atmosphere, and moving vehicles.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with brand link, store/admin links, cart icon with item count badge, Internet Identity auth button, and a mobile menu toggle.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product as a card with image header, title, description, account details preview, price, and Add to Cart / Buy Now buttons.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts newly authenticated users to create a gamer profile by entering a display name, then saves it via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with an authenticated or anonymous identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart, supporting add, remove, and clear operations with computed total item count and total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status flags.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including CRUD operations for categories, products, user profiles, and payment/order mutations via the ICP actor.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Orbitron, Rajdhani, Inter), sets up Tailwind directives, defines CSS custom properties for a dark gaming theme, and adds utility classes for neon effects, brand gradient text, and custom scrollbars.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/models/Vehicle.tsx": "Defines 3D vehicle components (SportsCar, Motorcycle, RealisticCar) using React Three Fiber/Three.js geometry, and a Vehicle component that animates them along a lane at a given speed using useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page that checks authentication and admin status before rendering tabbed management UI for Categories and Products using CategoryManager and ProductManager components.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page that guides authenticated users through cart review, payment method selection, payment details, and order confirmation, placing orders via the usePlaceOrder mutation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that reads an orderId from URL search params, fetches the order details, and displays a success screen with order info and payment method label.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page that fetches and displays a single product's info, category, availability, and trust badges, with Add to Cart and Buy Now actions.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page displaying a hero banner, category cards, and filterable/sortable product listings. Uses search, category selection, and sort controls to filter available products fetched via custom query hooks.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing. Supports sessionStorage-backed persistence and safe removal of sensitive params from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with gaming-specific fonts (Orbitron, Rajdhani), oklch-based color tokens, neon shadow utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot describing Game Vault, a gaming accounts e-commerce store on ICP with a Three.js loading screen, admin panel, Internet Identity auth, and multi-method checkout flows. Tracks versioned features, known issues, and architectural notes."
}