{
  "backend/main.mo": "Main Motoko actor defining the Game Vault backend with state and CRUD operations for products, categories, orders, and user profiles, plus authorization via AccessControl and MixinAuthorization mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their IDs, titles, affected files, component dependencies, test IDs, and confidence levels — primarily covering sunset theme replacement across CSS, Tailwind config, and frontend components.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short descriptions summarizing each component's purpose, props, and key implementation details for build planning reference.",
  "frontend/index.css": "Tailwind base CSS file defining OKLCH-based design tokens for light and dark modes via CSS custom properties, with minimal base layer rules applying border and background/foreground defaults.",
  "frontend/index.html": "HTML entry point for the Game Vault React app with the `dark` class set on `<html>` and inline critical CSS to prevent white flash before React hydrates.",
  "frontend/src/App.tsx": "Root React component implementing hash-based client-side routing, cart state management, authentication checks, profile setup modal, and rendering of all page components wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-screen access denied UI component displaying a shield icon, error message, and a back-to-store link, styled with OKLCH color values for admin-restricted routes.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "An admin UI component for managing the admin username whitelist, supporting adding and removing usernames with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "A form component for creating or editing a product category, using add/update mutation hooks and rendering name and description fields.",
  "frontend/src/components/admin/CategoryManager.tsx": "An admin panel component that lists all product categories in a table and provides dialogs for adding, editing, and deleting categories using query and mutation hooks.",
  "frontend/src/components/admin/OrderManager.tsx": "An admin component that displays all orders in a table, showing buyer details, product info fetched per-row, payment method, and order status badges.",
  "frontend/src/components/admin/ProductForm.tsx": "A form component for creating or editing a product listing, with fields for game name, category, title, description, account details, price, and availability, using add/update mutation hooks.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin UI component that displays a table of all products with options to add, edit, and delete them using dialogs and the ProductForm component.",
  "frontend/src/components/AdminAccessControl.tsx": "A guard component that restricts access to admin content by verifying Internet Identity authentication, user profile existence, and admin status, showing appropriate loading/error states at each step.",
  "frontend/src/components/CartDrawer.tsx": "A slide-in drawer component displaying cart items with remove functionality, a running total, and a checkout button, toggled via an overlay.",
  "frontend/src/components/CategoryCard.tsx": "A styled button component representing a product category that highlights when selected and calls a callback on click.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout payment component for cryptocurrency (BTC/ETH) that displays a mock wallet address, copy button, QR placeholder, and a confirmation checkbox before submitting the order.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout payment component that accepts a UK gift card code, validates it with a mock async check, and enables order confirmation only on successful validation.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout payment component that splits the total into three monthly installments, displays a payment schedule, and requires user agreement before confirming the order.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "UI component that renders a grid of selectable payment method cards (PayPal, Crypto, Gift Card, Pay in 3) and highlights the currently selected option.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout payment component that simulates a PayPal redirect flow, showing a mock authorisation confirmation step before the user finalises the order.",
  "frontend/src/components/Footer.tsx": "A site footer displaying the Game Vault brand, store navigation links, accepted payment methods, and a copyright bar with a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "A no-op stub component kept for compatibility; actual layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "A Three.js-powered animated loading screen that renders a cyberpunk city drive scene with a progress bar, then fades out and calls an onComplete callback.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with logo, store/admin page links, a cart icon with item count badge, and an Internet Identity login/logout button with mobile menu support.",
  "frontend/src/components/ProductCard.tsx": "A card component displaying a product's category, game name, title, description, and price, with an add-to-cart button and a click handler to view details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and form submission to create the username via a mutation hook.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an ICP backend actor using the current Internet Identity, initialising admin access control when a token is present, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Defines a React context and provider for shopping cart state, exposing add, remove, and clear item operations along with computed totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication via DFINITY's AuthClient, managing login status, identity persistence, and session lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, categories, products, and orders using a shared actor.",
  "frontend/src/index.css": "Global stylesheet defining a dark sunset-themed design system with CSS custom properties, Tailwind layers, custom fonts (Orbitron/Rajdhani), and utility classes for glow effects and gradients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle components (sports car, motorcycle, realistic car) with geometry and materials, animated along lanes using react-three-fiber.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tabbed navigation for managing categories, products, orders, and admin whitelist, wrapped in an access control guard component.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info, renders the appropriate payment component, and submits an order via the usePlaceOrder hook.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays a success screen after order placement, fetching and showing order details (product, payment method, status) by order ID with loading and error states.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows full details for a single product including description, pricing, availability, and an Add to Cart button, with a back-navigation control.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with a hero section, search input, and a filtered product grid loaded from the backend, handling loading and empty states.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a sunset/dusk color palette, Orbitron and Rajdhani font families, custom box shadows, glow animations, and plugin registrations.",
  "project_state.json": "Tracks the full project state (version 21) for 'Game Vault', a Shopify-style gaming accounts e-commerce store on ICP with Three.js loading screen, Internet Identity auth, username system, admin panel, and multiple payment flows. Documents existing features, known issues, and architectural notes."
}