{
  "backend/main.mo": "Main Motoko actor defining the Game Vault backend with types and state for products, categories, orders, user profiles, subscription tiers, and store settings, plus shared/query functions for CRUD operations, admin access control, and order approval logic.",
  "backend/migration.mo": "Data migration module that upgrades existing Order records from OldOrder (without approvalStatus, giftCardNumber, giftCardBalance) to NewOrder by adding those fields with default values.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles to the frontend/backend files they affect, associated components, and test IDs, covering order approval hooks, gift card fields, and placeOrder updates.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, describing their purpose and recent changes across pages, components, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML shell for the Game Vault React app with the dark class pre-applied and inline critical CSS to prevent a white flash before React hydrates.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, ThemeProvider, hash-based routing, cart state, and authentication-gated profile setup modal, rendering the appropriate page component per route.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page access denied UI component displaying a shield icon, error message, and a back-to-store link for users lacking admin privileges.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "Admin UI component for managing a whitelist of admin usernames, supporting add and remove operations with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin table component that displays all orders with buyer details, product names (fetched per row), payment method badges, and order status badges.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin payments dashboard that lists all orders in a table with payment method and approval status badges, and allows admins to approve or decline individual orders.",
  "frontend/src/components/admin/ProductForm.tsx": "A form component for creating or editing a product, handling fields like game name, title, description, price, and availability, with add/update mutations.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin product management component that lists all products in a table and provides dialogs for adding, editing, and deleting products using React Query.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), with pre-populated fields loaded from store settings and individual save actions for each wallet.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for managing subscription tiers, allowing editing of monthly/yearly prices and toggling free trial availability per tier.",
  "frontend/src/components/AdminAccessControl.tsx": "Wraps admin panel children with authentication and role checks, fetching the current user's username via principal and verifying admin status before granting access.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component that displays cart items with removal controls, calculates the total price, and provides a checkout button.",
  "frontend/src/components/CategoryCard.tsx": "Renders a selectable category filter button that highlights when active and calls a callback on selection.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a lightweight SVG QR code generator, copy-to-clipboard, and a confirm payment button.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code, collects card number and balance, and triggers order confirmation.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into 3 monthly installments, displays the schedule with due dates, and requires user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight for the currently selected method.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user returns from PayPal before placing the order.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Stub component that is no longer used; layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "Full-screen loading screen with a 40-second video background and an animated clip-path progress reveal of the 'GAME VAULT' title, completing with a fade-out transition.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout handling.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's game name, title, description, price, and category badge with add-to-cart and view-details actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and form submission via React Query mutations.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart, supporting add, remove, and clear operations with computed total items and total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity state, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, categories, products, orders, and store settings via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet defining a sunset-themed design system with CSS custom properties for colors, Tailwind base/utilities, custom glow effects, and Orbitron/Rajdhani font imports.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle models (SportsCar, Motorcycle, RealisticCar) as React components using react-three-fiber, with animated movement via useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tabbed navigation for managing products, orders, payments, admin whitelist, subscriptions, and store settings. Wraps content in AdminAccessControl for authorization.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info and places orders via usePlaceOrder, supporting PayPal, crypto, gift card, and Pay in 3 payment methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that polls order status every 30 seconds and displays order details, product info, payment method, and an approval status badge (approved/declined/pending).",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing game name, description, category, price, and availability with an add-to-cart button in a sticky sidebar layout.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with a hero section, search bar, and filtered product grid fetched from the backend, mapping category IDs to names for display.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Subscription checkout page with a step indicator guiding users through plan review, payment method selection (PayPal or crypto), and payment details, including free trial display and mock crypto addresses.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying four subscription tiers (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, tier cards showing prices and perks, and a subscribe button that triggers a callback with the selected tier and billing info.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, with helpers to persist values in sessionStorage and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a sunset color palette (gold, orange, pink, purple), Orbitron/Rajdhani fonts, custom box shadows, and animations like pulse-glow, float, and shimmer.",
  "project_state.json": "Project state snapshot describing Game Vault, a gaming accounts e-commerce store on ICP with Internet Identity auth, sunset UI theme, subscription tiers, admin panel, and known issues around admin access control and category creation."
}