{
  "backend/main.mo": "Main Motoko actor defining all backend types, state (products, categories, orders, users, subscriptions, store settings), and public API functions for a game vault store with admin access control and PIN lockout logic.",
  "backend/migration.mo": "Migration module that defines OldActor and NewActor state shapes (identical here) and a `run` function that carries forward all state while forcing `tiersInitialized` to true.",
  "feature_evidence.json": "Feature evidence report listing two audit/fix features: one for the `placeOrder` mutation in `useQueries.ts` and one for `OrderManager.tsx`/`PaymentsManager.tsx` admin components, each with associated test IDs and file targets.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, serving as a reference document for build planning and component understanding.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for both light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML entry point with the `dark` class pre-applied and inline critical CSS setting a dark background to prevent white flash before React hydrates.",
  "frontend/src/App.tsx": "Root React app component implementing hash-based client-side routing, cart state, authentication via Internet Identity, profile setup modal, and rendering of all page components wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Presentational component displaying an access denied message with a shield icon and a back-to-store link, shown when a user lacks admin privileges.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "Admin UI component for managing the admin username whitelist, allowing adding and removing admin users with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin component that displays all orders in a searchable table with status badges and payment method labels, including loading/error states with retry functionality.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin component for reviewing and actioning pending orders, displaying payment method and status badges with approve/decline buttons that trigger mutations and show toast notifications.",
  "frontend/src/components/admin/ProductForm.tsx": "A form component for creating or editing products, handling fields like game name, title, description, price (converted to pence), and availability, with add/update mutations on submit.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin UI component that lists all products in a table with options to add, edit, and delete them using dialogs and confirmation alerts. Fetches products and categories via custom query hooks and renders a ProductForm for create/edit operations.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin settings panel for managing PayPal, Bitcoin, and Ethereum wallet addresses, pre-populating fields from stored settings and saving each independently with toast feedback.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for viewing and editing subscription tier pricing (monthly/yearly) and toggling free-trial availability per tier, with inline edit state and toast notifications.",
  "frontend/src/components/AdminAccessControl.tsx": "Wraps admin content behind Internet Identity authentication and a 4-digit PIN verification, handling lockout countdowns and error states before rendering children.",
  "frontend/src/components/CartDrawer.tsx": "Slide-in cart drawer component that displays cart items with prices, supports item removal, shows a running total, and triggers checkout.",
  "frontend/src/components/CategoryCard.tsx": "Renders a selectable category filter button that highlights when active and calls a callback on selection.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout payment component for BTC and ETH that displays wallet addresses with a lightweight SVG QR code generator, copy-to-clipboard functionality, and a confirm payment button.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout payment component for UK gift cards that handles code validation (mock), collects gift card number and balance, and triggers order confirmation when all fields are valid.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout payment component that splits an order total into three equal monthly installments, displays a payment schedule, and requires user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight on the selected option.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "React component for PayPal checkout flow that shows a redirect button to PayPal and, after simulated redirect, a confirm order button to finalize the purchase.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "Stub component kept for compatibility; layout is handled directly in App.tsx and this renders nothing.",
  "frontend/src/components/LoadingScreen3D.tsx": "Full-screen loading splash with a looping NYC sunset video background and a 40-second clip-path progress reveal of the 'GAME VAULT' title before allowing entry.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's category, game name, title, description, and price with an 'Add to Cart' button and a click handler to view details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and validation (no spaces, min 3 chars) before submitting via the createUsername mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart with add, remove, and clear operations, plus derived totals for item count and price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions and identity state through a React context provider and hook.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including CRUD operations for categories, products, orders, and user profiles via the backend actor.",
  "frontend/src/index.css": "Global stylesheet defining the sunset-themed design system with CSS custom properties for colors, Tailwind base/utilities layers, and custom glow/gradient utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/models/Vehicle.tsx": "Defines three 3D vehicle models (SportsCar, Motorcycle, RealisticCar) using React Three Fiber primitives, and a Vehicle component that animates each along a lane with configurable speed and color.",
  "frontend/src/pages/AdminPanelPage.tsx": "Renders a tabbed admin dashboard with sections for Products, Orders, Payments, Admins, Subscriptions, and Settings, wrapped in an AdminAccessControl gate.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout flow (review, contact, payment method, payment details) that collects user info, selects a payment method, and submits an order via the placeOrder mutation.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation after purchase, showing order status (pending/approved/declined) and product details, with a generic success screen fallback when the order ID is unknown.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows a single product's details (name, description, price, availability) with an add-to-cart button and a back navigation link.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page that fetches and displays available products in a searchable grid, with a hero banner and category mapping support.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and Cryptocurrency payment methods, with steps for plan review, payment method selection, payment details, and confirmation. Includes a step indicator, mock crypto addresses/rates, and free trial messaging.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription plans listing page displaying four tiers (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, tier-specific icons and colors, and a subscribe button that triggers the checkout flow.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, using sessionStorage for cross-navigation persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a sunset-themed design system with custom color tokens, Orbitron/Rajdhani fonts, glow box shadows, and animations like pulse-glow, float, and shimmer.",
  "project_state.json": "Project state snapshot (version 77) describing Game Vault, a gaming accounts e-commerce store on ICP with Internet Identity auth, sunset UI theme, subscription tiers, admin PIN gate, and known issues around product/category creation."
}