{
  "backend/main.mo": "Main Motoko actor defining the Game Vault backend with types and state for products, categories, orders, user profiles, store settings, and subscription tiers, plus admin-gated CRUD and query functions using an AccessControl mixin.",
  "feature_evidence.json": "Feature evidence report confirming that AdminAccessControl.tsx was rewritten to use a manual username-entry form calling `isAdminUsername` instead of auto-resolving access via Internet Identity state.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of all frontend source files, serving as a reference index for the project's React components and pages.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH design tokens for light and dark themes, including sidebar, chart, and semantic colour variables.",
  "frontend/index.html": "HTML shell for the Game Vault React app with the `dark` class pre-applied and inline critical CSS to prevent a white flash before hydration.",
  "frontend/src/App.tsx": "Root React component that sets up QueryClient, ThemeProvider, hash-based routing, cart state, Internet Identity auth, and profile-setup modal, rendering the correct page component per route.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Presentational component that displays a styled 'Access Denied' message with a shield icon and a back-to-store link using sunset theme colours.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "React component for managing an admin username whitelist, allowing admins to add or remove usernames with confirmation dialogs, backed by React Query cache mutations.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin component that fetches and displays all orders in a table, showing buyer info, product name, payment method, and order status.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin component for reviewing and acting on orders, displaying payment method and approval status badges with approve/decline action buttons per order row.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, price, and availability with add/update mutations.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin component that lists all products in a table with options to add, edit, or delete products using dialogs and confirmation alerts.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), pre-populating fields from fetched settings and saving changes individually.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin UI component for managing subscription tiers, allowing editing of monthly/yearly prices and toggling free trial availability per tier.",
  "frontend/src/components/AdminAccessControl.tsx": "Gate component that renders a sunset-themed username-entry form, calls the backend `isAdminUsername` function on submit, and either renders children on success or shows an access-denied screen with a retry option.",
  "frontend/src/components/CartDrawer.tsx": "A slide-in cart drawer component that displays cart items with remove functionality, calculates the total price, and provides a checkout button.",
  "frontend/src/components/CategoryCard.tsx": "A button component that renders a selectable product category pill with active/inactive styling.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a generated SVG QR code and copy functionality.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code and collects card number and balance before confirming the order.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into 3 monthly installments, showing a schedule of due dates and requiring user agreement before confirming.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "UI component that renders a grid of selectable payment method options (PayPal, Crypto, Gift Card, Pay in 3) and highlights the currently selected one.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component simulating a PayPal redirect flow, showing a redirect button and then a confirmation button after the user returns from PayPal.",
  "frontend/src/components/Footer.tsx": "A site footer displaying the Game Vault brand, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "A no-op stub component kept for compatibility; layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "A full-screen loading screen with a background video and a 40-second animated text reveal progress indicator before allowing the user to enter the store.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout support.",
  "frontend/src/components/ProductCard.tsx": "A card component displaying a product's game name, title, description, price, and an add-to-cart button with a click-through to a detail view.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal that prompts newly authenticated users to choose a unique username, with debounced availability checking and validation before submission.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and caches an authenticated or anonymous backend actor using the user's Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCart.ts": "Defines a React context and provider for shopping cart state, exposing methods to add, remove, and clear items along with computed totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/clear functions and status flags.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, categories, products, orders, and subscriptions.",
  "frontend/src/index.css": "Global stylesheet defining a sunset-themed design system with CSS custom properties, Tailwind layers, and utility classes for glow effects and gradients.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle models (sports car, motorcycle, realistic car) as React components with geometry, materials, and animation via useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tabbed navigation for managing products, orders, payments, admin whitelist, subscriptions, and store settings, wrapped in access control.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info and places an order via the usePlaceOrder hook, supporting PayPal, crypto, gift card, and Pay-in-3 payment methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details after purchase, polling every 30 seconds for live approval status updates and showing approved/declined/pending badges alongside product and payment info.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows a detailed view of a single product including description, pricing, availability, and an add-to-cart button, with a back navigation to the storefront.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page that fetches and displays available products with a search bar and category mapping, handling loading, error, and empty states.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and cryptocurrency payment methods, displaying tier details, billing cycle, free trial info, and mock crypto addresses.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, pricing, perks, and a subscribe button; fetches tier data via useSubscriptionTiers hook and delegates purchase to an onSubscribe callback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a sunset color palette (gold, orange, pink, purple, dusk tones), custom fonts (Orbitron, Rajdhani), neon/sunset box shadows, and keyframe animations like pulse-glow, float, and shimmer.",
  "project_state.json": "Project state snapshot (version 51) describing the Game Vault ICP e-commerce app's architecture, features (sunset theme, subscription tiers, admin panel, auth, checkout flows), and known issues such as broken admin category/product creation."
}