{
  "backend/main.mo": "Main Motoko actor for the Game Vault backend, defining types and state for products, categories, orders, user profiles, store settings, and subscription tiers, with admin-gated CRUD operations and access control via a mixin.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of the AdminAccessControl component rewrite, listing affected files, components, and test IDs for the sequential auth gate feature.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key changes made to each component or page.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, border, and chart color variables.",
  "frontend/index.html": "HTML entry point for the Game Vault app with the dark class applied, inline critical CSS to prevent white flash, and a script tag loading the React app.",
  "frontend/src/App.tsx": "Root React application component implementing hash-based routing, cart state management, Internet Identity authentication, profile setup modal, and rendering of all page components wrapped in QueryClient and ThemeProvider.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays a styled 'Access Denied' screen with a shield icon and a back-to-store link, using sunset/OKLCH theme colors for unauthorized admin access attempts.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "Admin UI component for managing the admin username whitelist, allowing adding and removing admin users with confirmation dialogs and React Query cache updates.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin table view displaying all orders with buyer details, product name (fetched per row), payment method badge, and order status badge.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin payments dashboard that lists all orders in a table with payment method and approval status badges, and allows approving or declining individual orders via mutation hooks.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, account details, price (converted to pence), and availability, using add/update product mutations.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin product list view with a table of all products, supporting add (via dialog), edit, and delete (via alert dialog) operations using ProductForm and relevant query hooks.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin component for managing store payment wallet addresses (PayPal, Bitcoin, Ethereum), with pre-populated fields loaded from settings and individual save buttons for each wallet.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin component for managing subscription tiers, allowing editing of monthly/yearly prices and toggling free trial availability per tier.",
  "frontend/src/components/AdminAccessControl.tsx": "Guards admin routes by checking if the authenticated Internet Identity principal has an admin username via the backend actor, rendering children only on access granted and showing a profile setup modal or denial screen otherwise.",
  "frontend/src/components/CartDrawer.tsx": "A slide-in drawer component that displays cart items with remove buttons, calculates the total price, and provides a checkout action button.",
  "frontend/src/components/CategoryCard.tsx": "A styled toggle button that renders a product category name and highlights when selected, calling an onSelect callback on click.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays wallet addresses with a generated QR code, copy functionality, and converted crypto amounts.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code and collects the card number and balance before confirming the order.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into 3 monthly installments, showing a schedule of due dates and requiring user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "Renders a grid of selectable payment method buttons (PayPal, Cryptocurrency, UK Gift Card, Pay in 3) with visual highlight for the currently selected method.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user indicates they have authorized payment on PayPal.",
  "frontend/src/components/Footer.tsx": "Site footer displaying the Game Vault brand, store navigation links, accepted payment methods, and a copyright bar with a caffeine.ai attribution link.",
  "frontend/src/components/Layout.tsx": "A no-op stub component kept for compatibility; actual layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "A full-screen loading splash that plays a background video and animates a clip-path text reveal over 40 seconds, then shows an 'Enter Store' button once the timer completes.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and an Internet Identity login/logout button.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product's category, game name, title, description, and price with an 'Add to Cart' button and a click handler to view full product details.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal component that prompts new users to choose a username, with debounced availability checking and validation (no spaces, min 3 chars) before submitting via the createUsername mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCart.ts": "Provides a React context and hook for managing a shopping cart, supporting add, remove, and clear operations with computed total items and total price.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication provider and hook using DFINITY's AuthClient, exposing identity state, login/logout functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including user profiles, usernames, admin checks, products, orders, and store settings via the ICP actor.",
  "frontend/src/index.css": "Defines global CSS with Tailwind directives, a sunset-themed design token palette (OKLCH colors), custom glow utility classes, and Orbitron/Rajdhani font assignments.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle models (SportsCar, Motorcycle, RealisticCar) as React components using react-three-fiber, with geometry, materials, and animated movement via useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tab-based navigation for managing products, orders, payments, admins, subscriptions, and store settings. Wraps content in AdminAccessControl to restrict access.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects order info and submits it via usePlaceOrder, supporting PayPal, crypto, gift card, and Pay in 3 methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that fetches and displays order details including product info and live approval status (pending/approved/declined) after a successful checkout.",
  "frontend/src/pages/ProductDetailPage.tsx": "Product detail page showing game name, description, category, price, availability, and an add-to-cart button in a two-column layout with a sticky sidebar.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront page with a hero section, search bar, and a filtered product grid loaded from the backend, supporting search by game name, title, or description.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and cryptocurrency payment methods, with a step indicator, plan review, and free trial display for a given subscription tier and billing cycle.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, pricing, perks, and a subscribe button; fetches tier data via a query hook and delegates purchase handling to a parent-provided callback.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting URL parameters from both query strings and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with CSS-variable-based color tokens (including a sunset palette), Orbitron/Rajdhani fonts, custom box shadows, and keyframe animations; enables dark mode via class and registers animate, typography, and container-queries plugins.",
  "project_state.json": "Persistent project state document (version 65) summarizing the Game Vault ICP e-commerce app's architecture, feature set, known issues, and design decisions including the sunset theme, subscription tiers, admin panel, and payment flows."
}