{
  "backend/main.mo": "Main Motoko actor for the Game Vault backend, defining types and state for products, categories, orders, user profiles, store settings, and subscription tiers, with admin-gated CRUD operations and access control via mixins.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document containing one-to-two sentence summaries of each frontend source file, serving as a reference for the project's frontend components and pages.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark themes, including background, foreground, card, sidebar, and chart color variables.",
  "frontend/index.html": "HTML entry point for the Game Vault app with dark mode class, inline critical CSS to prevent white flash, and a script tag loading the React app.",
  "frontend/src/App.tsx": "Root React app component implementing hash-based client-side routing, cart state management, authentication via Internet Identity, and profile setup modal, rendering the appropriate page component per route.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays a styled access-denied message with a shield icon and a back-to-store link for users lacking admin privileges.",
  "frontend/src/components/admin/AdminWhitelistManager.tsx": "React component for managing an admin username whitelist, allowing admins to add or remove usernames with confirmation dialogs and toast notifications, backed by React Query cache.",
  "frontend/src/components/admin/CategoryForm.tsx": "Empty file with no content.",
  "frontend/src/components/admin/CategoryManager.tsx": "Empty file with no content.",
  "frontend/src/components/admin/OrderManager.tsx": "Admin component that fetches and displays all orders in a table, showing buyer info, product name, payment method badge, and order status for each order.",
  "frontend/src/components/admin/PaymentsManager.tsx": "Admin component for reviewing and acting on orders, displaying payment method and approval status badges with approve/decline action buttons that call backend mutations.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing a product, handling fields like game name, title, description, price, and availability, with add/update mutations and toast feedback.",
  "frontend/src/components/admin/ProductManager.tsx": "Admin component that lists all products in a table with options to add, edit, or delete each product using dialogs and alert dialogs backed by React Query hooks.",
  "frontend/src/components/admin/StoreSettingsManager.tsx": "Admin settings component for managing PayPal, Bitcoin, and Ethereum wallet addresses, pre-populating fields from fetched store settings and saving each independently with toast feedback.",
  "frontend/src/components/admin/SubscriptionManager.tsx": "Admin UI component for managing subscription tiers, allowing editing of monthly/yearly prices and toggling free trial availability per tier with save/cancel controls.",
  "frontend/src/components/AdminAccessControl.tsx": "Gate component that checks admin access by prompting for a username, verifying it against the backend's `isAdminUsername` call, and rendering children only if access is granted.",
  "frontend/src/components/CartDrawer.tsx": "A slide-in cart drawer component that displays cart items with remove functionality, calculates the total price, and provides a checkout button.",
  "frontend/src/components/CategoryCard.tsx": "A button component representing a product category filter, with active/inactive styling based on selection state.",
  "frontend/src/components/checkout/CryptoPayment.tsx": "Checkout component for cryptocurrency payments (BTC/ETH) that displays a wallet address with a generated SVG QR code, copy functionality, and a confirm button.",
  "frontend/src/components/checkout/GiftCardPayment.tsx": "Checkout component for UK gift card payments that validates a gift card code, collects card number and balance, and triggers order confirmation.",
  "frontend/src/components/checkout/PayIn3Payment.tsx": "Checkout component that splits a payment into 3 monthly installments, displays the schedule with due dates, and requires user agreement before confirming the first payment.",
  "frontend/src/components/checkout/PaymentMethodSelector.tsx": "UI component that renders a grid of selectable payment method options (PayPal, Crypto, Gift Card, Pay in 3) and highlights the currently selected one.",
  "frontend/src/components/checkout/PayPalPayment.tsx": "Checkout component for PayPal payments that simulates a redirect flow, showing a confirmation step after the user 'returns' from PayPal before finalizing the order.",
  "frontend/src/components/Footer.tsx": "A site footer displaying the Game Vault brand, store navigation links, accepted payment methods, and a caffeine.ai attribution.",
  "frontend/src/components/Layout.tsx": "A no-op stub component kept for compatibility; actual layout is handled directly in App.tsx.",
  "frontend/src/components/LoadingScreen3D.tsx": "A full-screen loading screen with a 40-second video background and a clip-path progress reveal animation on the 'GAME VAULT' title, fading out when complete.",
  "frontend/src/components/Navigation.tsx": "A sticky top navigation bar with links to Store, Subscriptions, and Admin pages, a cart icon with item count badge, and Internet Identity login/logout support.",
  "frontend/src/components/ProductCard.tsx": "A card component displaying a product's game name, title, description, price, and category badge, with add-to-cart and view-details actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal for new users to choose a username, with debounced availability checking and validation before submitting via the createUsername mutation.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useCart.ts": "Defines a React context and provider for shopping cart state, exposing methods to add, remove, and clear items along with computed totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication via DFINITY's AuthClient, exposing login/clear functions and status flags.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks (queries and mutations) for interacting with the backend actor, covering user profiles, usernames, categories, products, orders, and more.",
  "frontend/src/index.css": "Global stylesheet that imports Orbitron/Rajdhani fonts, configures Tailwind, and defines a sunset/dusk-themed CSS variable palette with custom glow utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/models/Vehicle.tsx": "Defines Three.js 3D vehicle models (sports car, motorcycle, realistic car) as React components using @react-three/fiber, with animated movement via useFrame.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin panel page with tabbed navigation (products, orders, payments, admins, subscriptions, settings) wrapped in an AdminAccessControl guard component.",
  "frontend/src/pages/CheckoutPage.tsx": "Multi-step checkout page (review, contact, payment method, payment details) that collects user info and places an order via the usePlaceOrder hook, supporting PayPal, crypto, gift card, and Pay-in-3 payment methods.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details after purchase, polling every 30 seconds for live approval status updates and showing approved/declined/pending badges alongside product and payment info.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows a single product's full details (description, price, availability, category) in a two-column layout with a sticky sidebar containing an add-to-cart button.",
  "frontend/src/pages/StorefrontPage.tsx": "Main storefront listing page with a hero section, search bar, and filtered product grid fetched via React Query hooks, supporting navigation to product detail and add-to-cart actions.",
  "frontend/src/pages/SubscriptionCheckoutPage.tsx": "Multi-step subscription checkout page supporting PayPal and cryptocurrency payment methods, displaying tier details, billing cycle, free trial info, and mock crypto addresses for payment.",
  "frontend/src/pages/SubscriptionsPage.tsx": "React page displaying subscription tier cards (Starter, Basic, Premium, Pro) with monthly/yearly billing toggle, pricing, perks, and a subscribe button; fetches tier data via useSubscriptionTiers hook and delegates purchase to an onSubscribe callback.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routing, persist them to sessionStorage, and clean sensitive params from the URL bar without page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a sunset color palette (gold, orange, pink, purple, dusk tones), Orbitron/Rajdhani fonts, custom box shadows, and keyframe animations; includes animate, typography, and container-queries plugins.",
  "project_state.json": "Persistent project state document (version 59) summarizing the Game Vault ICP e-commerce app's architecture, features (loading screen, auth, admin panel, subscriptions, payment flows), and known issues such as broken category/product creation flows."
}