{
  "kind": "build_request",
  "title": "Fix admin authorization for product create, edit, and delete operations",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the backend admin authorization logic so that the caller's identity is correctly verified as an admin when invoking createProduct, updateProduct, and deleteProduct functions. The current check fails with 'Unauthorized: Only admins can update products' even when the user is logged in as an admin. Ensure the admin identity check uses the caller's principal (msg.caller) and correctly matches it against the stored admin list or whitelist.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Failed to update product: Unauthorized: Only admins can update products",
          "Please fix this I cant cerate or edit or delete products in the cerate products section in the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "An authenticated admin user can successfully create a new product via the admin panel without receiving an authorization error.",
        "An authenticated admin user can successfully update an existing product via the Edit Product form without receiving 'Unauthorized: Only admins can update products'.",
        "An authenticated admin user can successfully delete a product from the admin panel without receiving an authorization error.",
        "Non-admin users still receive an unauthorized error when attempting product create/edit/delete operations.",
        "The admin check uses msg.caller principal comparison, not a session token or username string match that could fail due to identity mismatch."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend ProductForm and ProductManager components pass the authenticated actor (not an anonymous actor) when calling createProduct, updateProduct, and deleteProduct mutations. Verify that useQueries hooks for these mutations use the authenticated actor from useActor so the caller principal is properly set.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Failed to update product: Unauthorized: Only admins can update products"
        ]
      },
      "acceptanceCriteria": [
        "Product mutation hooks (create, update, delete) use the authenticated actor, not an anonymous one.",
        "After logging in via Internet Identity and passing the admin PIN gate, product create/edit/delete calls succeed without authorization errors."
      ]
    }
  ],
  "constraints": [
    "Do not change the admin PIN gate flow in AdminAccessControl.tsx.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Keep all Motoko logic in backend/main.mo single actor."
  ],
  "nonGoals": [
    "Changing the admin whitelist management UI.",
    "Modifying the checkout or storefront flows.",
    "Adding new admin roles or permission levels."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}