{
  "kind": "build_request",
  "title": "Replace admin gate with manual username-entry screen",
  "projectName": "Game Vault",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-94",
      "text": "Rewrite `frontend/src/components/AdminAccessControl.tsx` to replace all previous auto-resolved gate logic with a manual username-entry screen. When any user navigates to the admin panel, the component must immediately render a styled form containing: a heading (e.g. 'Admin Access'), a text input labelled 'Enter your username', and a 'Submit' button. On submit, call the backend `isAdminUsername` function with the exact string the user typed. If the backend returns `true`, transition to 'access granted' and render the children. If the backend returns `false`, render the `AccessDeniedScreen` with an access-denied message. Do NOT silently fetch the authenticated user's stored username, do NOT call `getUsername` or any React Query hook as part of the gate decision, and do NOT auto-resolve access based on Internet Identity authentication state. The username the user types is the only input used for the whitelist check. Show a loading/spinner state only while the `isAdminUsername` backend call is in-flight. Apply the sunset theme (dusk-bg/dusk-mid backgrounds, sunset-gold/sunset-orange accent colours, Orbitron/Rajdhani fonts, sunset glow effects) to the username-entry form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent-user-1",
          "msg-recent-user-2"
        ],
        "quotes": [
          "make it so the user has to enter there username to get into the admin pannel if they are on the admin whitelist",
          "The admin gate screen should show a manual username input field where the user types their username",
          "On submit, it checks that typed username against the backend isAdminUsername whitelist",
          "This replaces the current auto-resolved gate"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin (or the admin panel route) always shows a username input form, regardless of the user's Internet Identity authentication state.",
        "The form contains a text input and a 'Submit' button; no automatic resolution or silent checks occur before the user submits.",
        "On submit, the typed username string is passed directly to the backend `isAdminUsername` function.",
        "If `isAdminUsername` returns true, the admin panel content (children) is rendered immediately.",
        "If `isAdminUsername` returns false, the `AccessDeniedScreen` component is rendered with an access-denied message.",
        "A loading/spinner state is shown only while the `isAdminUsername` backend call is pending.",
        "No call to `getUsername`, no React Query username hooks, and no Internet Identity identity checks are used as part of the gate decision flow.",
        "The username-entry form uses sunset theme styling (dusk-bg/dusk-mid backgrounds, sunset-gold/sunset-orange accents, Orbitron/Rajdhani fonts)."
      ]
    }
  ],
  "constraints": [
    "Do not use the authenticated user's stored username or any React Query hook (getUsername, useUsername, useIsAdminUsername) as part of the admin gate decision — only the manually typed username is checked.",
    "Do not alter the backend `isAdminUsername` function signature or the admin whitelist data.",
    "The 'Game Vault' gradient text (red → purple → orange) must remain unchanged wherever it appears.",
    "Immutable frontend paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui) must not be modified."
  ],
  "nonGoals": [
    "Changing any backend Motoko logic.",
    "Modifying the admin whitelist management UI or its data.",
    "Adding password or passcode fields — username text input is the only credential.",
    "Changing any other frontend page or component outside of AdminAccessControl.tsx."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}