{
  "kind": "build_request",
  "title": "Replace admin gate with 4-digit PIN (2006) + lockout system",
  "projectName": "Game Vault",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-114",
      "text": "Add a 4-digit admin PIN system to `backend/main.mo`. Hardcode the PIN as `2006`. Add a stable map `adminPinAttempts : HashMap<Principal, Nat>` tracking failed attempt counts per principal, and a stable map `adminPinLockoutTime : HashMap<Principal, Int>` tracking lockout expiry timestamps per principal. Expose the following functions: `verifyAdminPin(pin: Text) : async Result.Result<Bool, Text>` — checks the submitted PIN against `\"2006\"`, increments the failed attempt counter on mismatch, locks out the principal for 3600 seconds (1 hour) after 4 failed attempts, returns `#ok(true)` on correct PIN (and resets the attempt counter), returns `#err(\"Locked out. Try again in X minutes.\")` if the principal is currently locked out, and returns `#ok(false)` on wrong PIN with remaining attempts info in the error; `getAdminPinLockoutStatus(principal: Principal) : async { isLockedOut: Bool; remainingSeconds: Int }` — returns whether the caller is currently locked out and how many seconds remain. Timestamps must use `Time.now()` (nanoseconds) converted appropriately.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "make it so to access the admin panel u need a 4 digit code",
          "And make the pin code 2006",
          "4 attempts then have to wait 1 hour"
        ]
      },
      "acceptanceCriteria": [
        "PIN is hardcoded as '2006' in the backend",
        "`verifyAdminPin` returns `#ok(true)` when called with '2006'",
        "`verifyAdminPin` returns `#ok(false)` (or error with attempt info) when called with any other value",
        "After 4 wrong PIN attempts by the same principal, subsequent calls return a lockout error",
        "Lockout duration is 1 hour (3600 seconds)",
        "Lockout state is stored in stable storage and survives canister upgrades",
        "`getAdminPinLockoutStatus` returns correct `isLockedOut` and `remainingSeconds` values",
        "Correct PIN resets the failed attempt counter for that principal"
      ]
    },
    {
      "id": "REQ-115",
      "text": "Add React Query hooks to `frontend/src/hooks/useQueries.ts` for the new PIN backend functions: `useVerifyAdminPin()` mutation that calls `verifyAdminPin` with the submitted PIN string — must await the actor call, unwrap the `#ok`/`#err` Result variant, throw a JavaScript `Error` on `#err`, and return the boolean result; `useAdminPinLockoutStatus()` query that calls `getAdminPinLockoutStatus` with the authenticated user's principal, enabled only when the user is authenticated, with `staleTime: 0` and `retry: 0` so it always reflects the live lockout state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "4 attempts then have to wait 1 hour"
        ]
      },
      "acceptanceCriteria": [
        "`useVerifyAdminPin` mutation correctly calls the backend `verifyAdminPin` function",
        "Mutation throws a JavaScript Error when the backend returns `#err` (e.g. lockout error)",
        "`useAdminPinLockoutStatus` query is enabled only when the user is authenticated",
        "Lockout status query has `staleTime: 0` and `retry: 0`"
      ]
    },
    {
      "id": "REQ-116",
      "text": "Rewrite `frontend/src/components/AdminAccessControl.tsx` to replace all previous gate logic with a new flow: (1) If the user is not authenticated via Internet Identity, immediately render a 'Please log in via Internet Identity to access the admin panel' prompt — do not spin or show a PIN form; (2) Once authenticated, render a styled 4-digit PIN entry screen with: a heading 'Admin Access', a subheading 'Enter the 4-digit PIN to continue', four individual single-digit input fields (or a single 4-character PIN input field), and a 'Submit' button — use a `<form>` element with `onSubmit` so both Enter key and button click trigger submission; (3) The `onSubmit` handler must call `event.preventDefault()`, set a local loading state, then call the backend `verifyAdminPin` function (via the actor directly, not React Query) with the entered PIN string; (4) If the backend returns `true` (correct PIN), transition to `status = 'granted'` and render children; (5) If the backend returns an error indicating lockout, display the lockout message (e.g. 'Too many failed attempts. Try again in X minutes.') and disable the form; (6) If the PIN is wrong but the principal is not yet locked out, display an inline error such as 'Incorrect PIN. X attempts remaining.' and clear the PIN input; (7) Any thrown error is caught in a try/catch and displayed as an inline error message — never swallow errors silently; (8) Show a loading spinner only while the `verifyAdminPin` call is in-flight; (9) Remove all previous `getUsername`, `isAdminUsername`, `useUsername`, `useIsAdminUsername`, and username-based gate logic from this component entirely; (10) Apply the sunset theme (dusk-bg/dusk-mid backgrounds, sunset-gold/sunset-orange accent colours, Orbitron/Rajdhani fonts, sunset glow effects) to the PIN entry form.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "make it so to access the admin panel u need a 4 digit code",
          "And make the pin code 2006",
          "4 attempts then have to wait 1 hour",
          "user must be logged in via Internet Identity first, then enter the PIN"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated users see a 'Please log in' prompt, not the PIN form",
        "Authenticated users immediately see the 4-digit PIN entry form",
        "Entering PIN '2006' and submitting transitions to access granted (admin panel renders)",
        "Entering any wrong PIN shows an inline error with remaining attempts",
        "After 4 wrong attempts, the form shows a lockout message with time remaining and disables the input/submit",
        "Pressing Enter in the PIN input triggers form submission",
        "Loading spinner shows only while the backend call is in-flight",
        "No username-based gate logic remains in this component",
        "Sunset theme is applied consistently to the PIN entry screen"
      ]
    },
    {
      "id": "REQ-117",
      "text": "Audit and update `frontend/src/pages/AdminPanelPage.tsx` to ensure it contains zero internal async gates, PIN verification calls, loading states, or `useEffect` checks of its own. The page must render its tabbed content (Products, Orders, Payments, Admins, Subscriptions, Settings) immediately and unconditionally once `AdminAccessControl` renders its children. Remove any remaining username-based or PIN-based gate logic from the page itself — all access control must be handled exclusively by the `AdminAccessControl` wrapper.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "make it so to access the admin panel u need a 4 digit code"
        ]
      },
      "acceptanceCriteria": [
        "AdminPanelPage renders its tabbed content immediately once AdminAccessControl grants access",
        "No internal `isAdminUsername`, `verifyAdminPin`, loading state, or async `useEffect` gate exists in AdminPanelPage",
        "All six tabs (Products, Orders, Payments, Admins, Subscriptions, Settings) are visible and functional"
      ]
    },
    {
      "id": "REQ-118",
      "text": "Update `backend/migration.mo` to ensure the new stable maps for `adminPinAttempts` and `adminPinLockoutTime` are handled correctly during canister upgrades. Both maps must default to empty on first deployment and must not cause data loss for existing stable state (products, orders, users, settings, subscription tiers, admin whitelist).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Lockout tracked per user principal in backend stable storage"
        ]
      },
      "acceptanceCriteria": [
        "Canister upgrades do not lose existing order, product, user, or settings data",
        "PIN attempt and lockout stable maps initialise to empty on first deployment",
        "Migration compiles without errors"
      ]
    }
  ],
  "constraints": [
    "PIN must be hardcoded as '2006' in the backend — not configurable from the UI",
    "Internet Identity login is required before the PIN form is shown",
    "Lockout must be enforced in the backend (not just the frontend) and tracked per Principal",
    "Lockout duration is exactly 1 hour (3600 seconds)",
    "Maximum failed attempts before lockout is 4",
    "All previous username/whitelist-based gate logic must be removed from AdminAccessControl.tsx",
    "Do not modify files listed in frontend.immutablePaths"
  ],
  "nonGoals": [
    "Allowing admins to change the PIN from the UI",
    "PIN reset functionality",
    "Email or SMS lockout notifications",
    "Rate limiting non-admin users on any page other than the admin gate"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}