{
  "kind": "build_request",
  "title": "Fix subscription tiers auto-seeding and orders not appearing in admin panel",
  "projectName": "Game Vault",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-125",
      "text": "Fix subscription tier seeding in `backend/main.mo` so the four default tiers (Starter, Basic, Premium, Pro) are seeded automatically at actor construction/upgrade time using a stable boolean flag (e.g. `subscriptionTiersInitialized`). The seeding logic must run once without requiring any external caller. Remove or neutralise the admin-username-whitelist guard on the internal seeding path so it cannot throw 'Unauthorized: Only admins can initialize subscription tiers'. The four tiers must be present and retrievable via `getSubscriptionTiers()` immediately after deployment without any manual action.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Unauthorized: Only admins can initialize subscription tiers",
          "No subscription tiers found"
        ]
      },
      "acceptanceCriteria": [
        "On first deployment (or after an upgrade), `getSubscriptionTiers()` returns all four tiers (Starter, Basic, Premium, Pro) without any manual initialization call.",
        "No 'Unauthorized' error is thrown during the auto-seeding process.",
        "The seeding only runs once; subsequent upgrades do not duplicate tiers.",
        "All four tiers have correct default prices: Starter £2.99/mo, Basic £5.99/mo, Premium £9.99/mo, Pro £14.99/mo (with ~20% yearly discount).",
        "The `freeTrialEnabled` and `perks` fields are populated with sensible defaults for each tier."
      ]
    },
    {
      "id": "REQ-126",
      "text": "Remove the 'Initialize Default Tiers' button and all associated initialization UI from `frontend/src/components/admin/SubscriptionManager.tsx`. Since tiers are now auto-seeded in the backend, the component must simply fetch and display the existing tiers via `useSubscriptionTiers()`. If the tiers query returns an empty array (which should no longer happen), display a neutral empty state without an initialization button.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "Initialize Default Tiers",
          "No subscription tiers found. Click \"Initialize Default Tiers\" to create the default set."
        ]
      },
      "acceptanceCriteria": [
        "The 'Initialize Default Tiers' button is no longer present in the SubscriptionManager component.",
        "The component renders the four tier cards/rows fetched from the backend as soon as data is available.",
        "No initialization-related error toast appears when visiting the Subscriptions tab.",
        "Admins can still edit prices and toggle free trial per tier via the existing controls."
      ]
    },
    {
      "id": "REQ-127",
      "text": "Trace and fix the full order placement flow end-to-end so that orders placed by users appear in both the admin panel Orders tab and the Payments tab. Audit `backend/main.mo` to verify the `placeOrder` function correctly persists new orders to stable storage and that `getOrders()` (used by the admin panel) retrieves all stored orders. Audit `frontend/src/pages/CheckoutPage.tsx` and `frontend/src/hooks/useQueries.ts` to ensure the `placeOrder` mutation is correctly called with all required fields, the actor call is properly awaited, and the `#ok`/`#err` result is unwrapped. Fix any issue found — whether it is a missing field in the payload, a type mismatch, a silent failure in the mutation, or a backend storage/retrieval bug — so that after a user completes checkout, the resulting order is immediately visible in the admin Orders and Payments tabs.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": [
          "orders don't show up in orders section not even in the payments section in admin panel",
          "Yes but the orders don't show up in orders section not even in the payments section in admin panel"
        ]
      },
      "acceptanceCriteria": [
        "After a user completes checkout (reaches order confirmation page), the order appears in the admin panel Orders tab.",
        "The same order also appears in the admin panel Payments tab with the correct payment method badge and 'Pending' approval status.",
        "The order record contains the buyer's username, email, contact info, product(s) purchased, payment method, and (for gift card orders) gift card number and balance.",
        "The `placeOrder` mutation in `useQueries.ts` correctly awaits the actor call, unwraps `#ok`/`#err`, and throws a JavaScript Error on `#err`.",
        "The backend `placeOrder` function persists the new order to the stable orders map and the order is returned by `getOrders()`.",
        "No silent failures occur — if `placeOrder` fails, an error toast is shown to the user."
      ]
    },
    {
      "id": "REQ-128",
      "text": "Update `backend/migration.mo` to ensure that any new stable state introduced by the subscription tier auto-seeding fix (e.g. `subscriptionTiersInitialized` flag or equivalent) is handled correctly during canister upgrades. Existing stable data (products, orders, users, subscription tiers, admin whitelist, store settings, PIN attempt maps) must not be lost. If no new stable state is introduced by REQ-125, confirm the existing migration module compiles without errors and remains valid.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-recent"
        ],
        "quotes": []
      },
      "acceptanceCriteria": [
        "The migration module compiles without errors after the REQ-125 backend changes.",
        "Canister upgrade does not lose any previously stored orders, products, users, subscription tiers, or admin whitelist entries.",
        "Any new stable variable introduced for the seeding flag is correctly initialised in the migration module."
      ]
    }
  ],
  "constraints": [
    "Do not add real payment API integrations — all payment flows remain mock/UI only.",
    "Do not alter the 'Game Vault' red → purple → orange gradient text in any component.",
    "The admin PIN (2006) and lockout logic must remain unchanged.",
    "The Frosty seed entry in the admin whitelist must not be removed.",
    "Frontend immutable paths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui) must not be modified.",
    "All four subscription tiers must use the existing price defaults: Starter £2.99/mo, Basic £5.99/mo, Premium £9.99/mo, Pro £14.99/mo."
  ],
  "nonGoals": [
    "Adding new subscription tiers beyond the existing four (Starter, Basic, Premium, Pro).",
    "Changing the admin PIN or lockout duration.",
    "Modifying the loading screen video or 40-second timer behaviour.",
    "Changing the payment methods available for subscriptions (PayPal and Crypto only).",
    "Altering the existing admin panel tab structure beyond removing the Initialize button."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}