{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace admin gate with manual username-entry screen",
  "requirements": [
    {
      "id": "REQ-94",
      "summary": "Rewrite AdminAccessControl to use manual username-entry screen instead of auto-resolved gate logic",
      "acceptanceCriteria": [
        "Navigating to /admin (or the admin panel route) always shows a username input form, regardless of the user's Internet Identity authentication state.",
        "The form contains a text input and a 'Submit' button; no automatic resolution or silent checks occur before the user submits.",
        "On submit, the typed username string is passed directly to the backend `isAdminUsername` function.",
        "If `isAdminUsername` returns true, the admin panel content (children) is rendered immediately.",
        "If `isAdminUsername` returns false, the `AccessDeniedScreen` component is rendered with an access-denied message.",
        "A loading/spinner state is shown only while the `isAdminUsername` backend call is pending.",
        "No call to `getUsername`, no React Query username hooks, and no Internet Identity identity checks are used as part of the gate decision flow.",
        "The username-entry form uses sunset theme styling (dusk-bg/dusk-mid backgrounds, sunset-gold/sunset-orange accents, Orbitron/Rajdhani fonts)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminAccessControl.tsx",
          "operation": "modify",
          "description": "Replace all previous auto-resolved gate logic (including useEffect with username resolution, React Query hooks, and identity checks) with a manual username-entry form. Implement a controlled text input for username entry with a Submit button. On form submission, call the backend `isAdminUsername` function with the exact typed username string. If the backend returns true, set local state to 'granted' and render children. If false, render the AccessDeniedScreen component with an access-denied message. Show a loading/spinner state only while the `isAdminUsername` backend call is in-flight. Remove all dependencies on useInternetIdentity, useGetUsername, useIsAdminUsername, or any other React Query hooks for gate decision logic. Apply sunset theme styling to the username-entry form: use dusk-bg/dusk-mid for backgrounds, sunset-gold/sunset-orange for accent colors, Orbitron for headings, Rajdhani for body text, and include sunset glow effects. Ensure the form is always displayed on navigation to the admin panel route, regardless of authentication state."
        }
      ]
    }
  ]
}