{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin authorization for product create, edit, and delete operations",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Ensure frontend ProductForm and ProductManager components pass the authenticated actor when calling product mutations",
      "acceptanceCriteria": [
        "Product mutation hooks (create, update, delete) use the authenticated actor, not an anonymous one.",
        "After logging in via Internet Identity and passing the admin PIN gate, product create/edit/delete calls succeed without authorization errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Review and ensure that useCreateProduct, useUpdateProduct, and useDeleteProduct mutations use the authenticated actor from useActor (not an anonymous actor). Verify that these mutations are called with actor from the useActor hook and that the actor is properly initialized before mutations are invoked. If mutations currently use an anonymous or stale actor reference, update them to use the authenticated actor consistently. This ensures the caller principal is correctly set when invoking createProduct, updateProduct, and deleteProduct backend functions."
        },
        {
          "path": "frontend/src/components/admin/ProductForm.tsx",
          "operation": "modify",
          "description": "Verify that ProductForm uses the authenticated actor when calling useCreateProduct or useUpdateProduct mutations. Ensure that the form does not instantiate or use an anonymous actor. Confirm that the mutation hooks are invoked with the authenticated actor from useActor so that the backend receives the correct caller principal. If the form currently calls mutations without the authenticated actor, update it to use the actor from useActor."
        },
        {
          "path": "frontend/src/components/admin/ProductManager.tsx",
          "operation": "modify",
          "description": "Verify that ProductManager uses the authenticated actor when calling useDeleteProduct mutation. Ensure that the delete operation does not use an anonymous actor. Confirm that the mutation hook is invoked with the authenticated actor from useActor so that the backend receives the correct caller principal. If the manager currently calls the delete mutation without the authenticated actor, update it to use the actor from useActor."
        }
      ]
    }
  ]
}