{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fully auto-resolved admin gate rewrite (useEffect + imperative async flow)",
  "requirements": [
    {
      "id": "REQ-111",
      "summary": "Rewrite AdminAccessControl.tsx with a fully auto-resolved, non-looping sequential gate using useEffect + local state imperative async flow",
      "acceptanceCriteria": [
        "When an unauthenticated user navigates to /admin, a 'Please log in via Internet Identity' prompt is shown immediately — no spinner, no form",
        "When an authenticated user with stored username 'Frosty' navigates to /admin, the component automatically fetches the username and calls isAdminUsername without any manual input",
        "If isAdminUsername returns true, the admin panel content (children) renders immediately",
        "If isAdminUsername returns false, AccessDeniedScreen renders immediately",
        "If the authenticated user has no username, ProfileSetupModal is triggered instead of a spinner",
        "The useEffect executes exactly once per authentication session — navigating away and back does not trigger duplicate calls or loops",
        "No chained React Query enabled flags or useIsAdminUsername/useUsername hooks are used for the gate decision",
        "A loading spinner is shown only during the brief in-flight period while getUsername or isAdminUsername calls are pending",
        "The component never enters a perpetual spinning/verifying state"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AdminAccessControl.tsx",
          "operation": "modify",
          "description": "Rewrite the component to use a fully auto-resolved imperative async flow inside a single useEffect with a hasRun ref guard. Define a local status state variable typed 'loading' | 'granted' | 'denied' | 'unauthenticated' | 'no-username'. When isAuthenticated is false, immediately render a 'Please log in via Internet Identity' prompt (no spinner, no form). Once isAuthenticated is true, run a useEffect that: (1) checks if hasRun.current is true and returns early if so; (2) sets hasRun.current = true; (3) imperatively calls actor.getUsername() to retrieve the stored username; (4) if the username is empty/null/undefined, set status to 'no-username' and render ProfileSetupModal; (5) if username is non-empty, imperatively call actor.isAdminUsername(username) with that exact string; (6) based on the result, set status to 'granted' or 'denied' and render children or AccessDeniedScreen accordingly. Show a loading spinner only while status === 'loading'. Do NOT use useIsAdminUsername, useUsername, or chained React Query enabled flags for the gate decision. Apply the sunset theme (dusk-bg/dusk-mid backgrounds, sunset-gold/sunset-orange accent colours, Orbitron/Rajdhani fonts, sunset glow effects) to the loading spinner, login prompt, and any intermediate states. Ensure the component never enters a perpetual spinning/verifying state by transitioning immediately once both calls complete."
        }
      ]
    },
    {
      "id": "REQ-112",
      "summary": "Audit and rewrite AdminPanelPage.tsx to remove any internal async gates or loading states",
      "acceptanceCriteria": [
        "AdminPanelPage.tsx contains no isAdminUsername calls, no useEffect with async access checks, and no internal loading/verifying states",
        "Once AdminAccessControl renders its children, the Products tab (default active tab) is visible immediately",
        "All tabs — Products, Orders, Payments, Admins, Subscriptions, Settings — are rendered without any additional async gating",
        "No 'Verifying access…' or spinner state originates from AdminPanelPage.tsx itself"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPanelPage.tsx",
          "operation": "modify",
          "description": "Audit the component to confirm it contains zero internal async gates, isAdminUsername calls, loading states, useEffect checks, or 'verifying access' state logic of its own. Remove any redundant admin checks, verifying-access states, or internal async logic that could produce a perpetual loading state independent of AdminAccessControl. The page must render its tabbed content (Products, Orders, Payments, Admins, Subscriptions, Settings) immediately and unconditionally as soon as AdminAccessControl renders its children. Ensure the Products tab (default active tab) is visible immediately without any additional async gating. Do not introduce any new loading or verification states within this component."
        }
      ]
    },
    {
      "id": "REQ-113",
      "summary": "Audit useQueries.ts to ensure no query configuration can cause AdminAccessControl to enter an infinite re-fetch loop",
      "acceptanceCriteria": [
        "Any useUsername / getUsername query hook remaining in useQueries.ts has staleTime ≥ 60 000 ms and retry = 1",
        "Any useIsAdminUsername query hook remaining in useQueries.ts has staleTime ≥ 60 000 ms and retry = 1",
        "Neither hook is imported or called inside AdminAccessControl.tsx for the gate decision",
        "No query configuration in useQueries.ts triggers repeated background refetches that could loop the admin gate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit the file to ensure no query or hook configuration can cause AdminAccessControl.tsx to enter an infinite re-fetch loop. If useUsername/getUsername or useIsAdminUsername hooks are still present for other consumers, set their staleTime to at least 60 000 ms and retry to 1. Confirm that none of these hooks are wired into AdminAccessControl's access-gating logic after the REQ-111 rewrite — the admin gate must rely solely on the imperative actor calls (getUsername and isAdminUsername) inside the useEffect. Do not remove the hooks if they are used elsewhere in the application, but ensure their configurations do not trigger repeated background refetches that could loop the admin gate."
        }
      ]
    }
  ]
}