{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix subscription tiers auto-seeding and orders not appearing in admin panel",
  "requirements": [
    {
      "id": "REQ-126",
      "summary": "Remove subscription tier initialization UI from SubscriptionManager component",
      "acceptanceCriteria": [
        "The 'Initialize Default Tiers' button is no longer present in the SubscriptionManager component.",
        "The component renders the four tier cards/rows fetched from the backend as soon as data is available.",
        "No initialization-related error toast appears when visiting the Subscriptions tab.",
        "Admins can still edit prices and toggle free trial per tier via the existing controls."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/SubscriptionManager.tsx",
          "operation": "modify",
          "description": "Remove the 'Initialize Default Tiers' button and all initialization UI logic. Simplify the component to fetch and display existing tiers via useSubscriptionTiers(). Replace the initialization empty state with a neutral message that does not prompt manual action. Keep the existing edit controls (price updates and free trial toggle) functional."
        }
      ]
    },
    {
      "id": "REQ-127",
      "summary": "Fix order placement flow so orders appear in admin panel Orders and Payments tabs",
      "acceptanceCriteria": [
        "After a user completes checkout (reaches order confirmation page), the order appears in the admin panel Orders tab.",
        "The same order also appears in the admin panel Payments tab with the correct payment method badge and 'Pending' approval status.",
        "The order record contains the buyer's username, email, contact info, product(s) purchased, payment method, and (for gift card orders) gift card number and balance.",
        "The `placeOrder` mutation in `useQueries.ts` correctly awaits the actor call, unwraps `#ok`/`#err`, and throws a JavaScript Error on `#err`.",
        "No silent failures occur — if `placeOrder` fails, an error toast is shown to the user."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Audit and fix the usePlaceOrder mutation to ensure it correctly awaits the backend actor.addOrder() call, properly unwraps the #ok/#err Result type, and throws a JavaScript Error on #err with a descriptive message. Verify that all required fields (productId, paymentMethod, status, approvalStatus, giftCardNumber, giftCardBalance) are passed with the correct types matching the backend interface. Ensure the mutation's onSuccess callback invalidates both 'orders' and 'allOrders' query keys so the admin panel reflects the new order immediately."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Audit the checkout flow to ensure the placeOrder mutation is called with all required parameters and that the mutation promise is properly awaited. Verify that userProfile data (username, email, contact) is correctly passed. Ensure that for gift card payments, giftCardNumber and giftCardBalance are captured from the GiftCardPayment component state and included in the mutation call. Add error handling to display a toast if the mutation fails. Confirm that on success, the user is redirected to the order confirmation page with the correct orderId."
        },
        {
          "path": "frontend/src/components/checkout/GiftCardPayment.tsx",
          "operation": "modify",
          "description": "Ensure the gift card number and balance fields are exposed to the parent CheckoutPage via props or callback so they can be included in the placeOrder mutation payload. Verify validation logic prevents submission if fields are empty or invalid. Add any missing state lifting or event handlers needed for the parent to retrieve these values."
        }
      ]
    }
  ]
}